In [2]:
import numpy as np
import pandas as pd

In [24]:
# students grade
stud_grade={
    "student_id":[1,1,1,2,2,2,3,3,3,4,4,4],
    "homework_id":[1,2,3,1,2,3,1,2,3,1,2,3],
    "grade":[7,6,6,8,np.nan,np.nan,4,np.nan,6,np.nan,np.nan,np.nan]

}
allstudent_homework=pd.DataFrame(stud_grade)
allstudent_homework

# allstate_student
allstate={ 
    "student_id":[1,2,3,4],
    "student_firstname":["Marie","Joan","Marie","Hugo"],
    "student_lastname":["Butters","Reed","Maynard","Wright"]
}
allstate_student=pd.DataFrame(allstate)
allstate_student

   student_id student_firstname student_lastname
0           1             Marie          Butters
1           2              Joan             Reed
2           3             Marie          Maynard
3           4              Hugo           Wright

In [2]:
groupby_id= allstudent_homework.groupby('student_id')
groupby_id

NameError: name 'allstudent_homework' is not defined

In [47]:
avg_grade=groupby_id['grade'].mean().reset_index()
avg_grade.rename(columns={'grade':'avg_grade'},inplace=True)

In [49]:
groupby_id['grade'].count()

student_id
1    3
2    1
3    2
4    0
Name: grade, dtype: int64

In [16]:
len(allstudent_homework['homework_id'].unique())

3

In [58]:
completion_rate=(groupby_id['grade'].count()/len(allstudent_homework['homework_id'].unique())*100).reset_index()
completion_rate.rename(columns={'grade':'completion_rate'},inplace=True)

In [59]:
l1=pd.merge(allstate_student,avg_grade,on='student_id')
l1

   student_id student_firstname student_lastname  avg_grade
0           1             Marie          Butters   6.333333
1           2              Joan             Reed   8.000000
2           3             Marie          Maynard   5.000000
3           4              Hugo           Wright        NaN

In [60]:
result=pd.merge(l1,completion_rate,on='student_id')
result

   student_id student_firstname student_lastname  avg_grade  completion_rate
0           1             Marie          Butters   6.333333       100.000000
1           2              Joan             Reed   8.000000        33.333333
2           3             Marie          Maynard   5.000000        66.666667
3           4              Hugo           Wright        NaN         0.000000

In [61]:
result[['student_firstname','avg_grade','completion_rate']]

  student_firstname  avg_grade  completion_rate
0             Marie   6.333333       100.000000
1              Joan   8.000000        33.333333
2             Marie   5.000000        66.666667
3              Hugo        NaN         0.000000

In [62]:
result[['student_firstname','avg_grade','completion_rate']]

  student_firstname  avg_grade  completion_rate
0             Marie   6.333333       100.000000
1              Joan   8.000000        33.333333
2             Marie   5.000000        66.666667
3              Hugo        NaN         0.000000

In [ ]:
1	2021-07-01 00:00:00	2021-09-30 00:00:00
2	2021-08-17 00:00:00	2021-09-01 00:00:00
3	2021-08-23 00:00:00	2021-09-14 00:00:00
4	2021-08-31 00:00:00	2021-09-23 00:00:00
5	2021-09-01 00:00:00	
6	2021-09-02 00:00:00	2021-09-03 00:00:00

In [70]:
data=dict(
    user_id=[1,2,3,4,5,6],
    contract_start=["2021-07-01","2021-08-17","2021-08-23","2021-08-31","2021-09-01","2021-09-02"],
    contract_end=['2021-09-30','2021-09-01','2021-09-14','2021-09-23','2021-09-30','2021-09-03']
)
data=pd.DataFrame(data)

# convert to datetime
data['contract_start']=pd.to_datetime(data['contract_start'])
data['contract_end']=pd.to_datetime(data['contract_end'])

In [101]:
(data['contract_end']>='2021-09-1')  & (data['contract_end']<'2021-09-30')

0    False
1     True
2     True
3     True
4    False
5     True
Name: contract_end, dtype: bool

In [85]:
pd.to_datetime("2020-09-25")

Timestamp('2020-09-25 00:00:00')

In [3]:
ship={
    "shipment_id":[101,101,101,102,103,103],
    "sub_id":[1,2,3,1,1,2],
    "weight":[10,20,10,50,25,30],
    "shipment_data":["2021-08-30","2021-09-01","2021-09-05","2021-09-02","2021-09-01","2021-09-02"]
}

df = pd.DataFrame(ship)

In [4]:
df

   shipment_id  sub_id  weight shipment_data
0          101       1      10    2021-08-30
1          101       2      20    2021-09-01
2          101       3      10    2021-09-05
3          102       1      50    2021-09-02
4          103       1      25    2021-09-01
5          103       2      30    2021-09-02

In [7]:
df['year_month']=pd.to_datetime(df['shipment_data']).dt.to_period("M")

In [13]:
df.groupby('year_month').size().to_frame("num_shipment").reset_index()

  year_month  num_shipment
0    2021-08             1
1    2021-09             5

In [27]:
dec = {
    "date":['2021-01-01','2021-01-01','2021-01-06','2021-01-02','2020-12-24','2020-12-08','2020-12-09','2021-01-10','2021-01-11','2021-01-12','2021-01-15','2020-12-17','2020-12-25','2020-12-25','2020-12-25','2020-12-06','2020-12-06','2021-01-14','2021-02-07','2021-02-10','2021-02-01','2021-02-01'],
    "account_id":["A1","A1","A1","A1","A1","A1","A1","A2","A2","A2","A2","A2",'A3',"A3","A3","A3","A3","A3","A1","A1","A2","A2"],
    "user_id":["U1","U2","U3","U1","U2","U1","U1","U4","U4","U4","U5","U4","U6","U6","U6","U7","U6","U6","U1","U2","U4","U5"]
    
}

In [28]:
len(dec['user_id'])

22

In [29]:
sf_events = pd.DataFrame(dec)

In [46]:
sf_events['date']

0     2021-01-01
1     2021-01-01
2     2021-01-06
3     2021-01-02
4     2020-12-24
5     2020-12-08
6     2020-12-09
7     2021-01-10
8     2021-01-11
9     2021-01-12
10    2021-01-15
11    2020-12-17
12    2020-12-25
13    2020-12-25
14    2020-12-25
15    2020-12-06
16    2020-12-06
17    2021-01-14
18    2021-02-07
19    2021-02-10
20    2021-02-01
21    2021-02-01
Name: date, dtype: object

In [44]:
sf_events.groupby(['user_id'])['date'].shift()

0            NaN
1            NaN
2            NaN
3     2021-01-01
4     2021-01-01
5     2021-01-02
6     2020-12-08
7            NaN
8     2021-01-10
9     2021-01-11
10           NaN
11    2021-01-12
12           NaN
13    2020-12-25
14    2020-12-25
15           NaN
16    2020-12-25
17    2020-12-06
18    2020-12-09
19    2020-12-24
20    2020-12-17
21    2021-01-15
Name: date, dtype: object

In [1]:
sf=sf_events
sf.sort_values(by='date',inplace=True)

NameError: name 'sf_events' is not defined

In [49]:
sf

          date account_id user_id  consecutive
16  2020-12-06         A3      U6            1
15  2020-12-06         A3      U7            2
5   2020-12-08         A1      U1            3
6   2020-12-09         A1      U1            4
11  2020-12-17         A2      U4            5
4   2020-12-24         A1      U2            6
14  2020-12-25         A3      U6            7
13  2020-12-25         A3      U6            7
12  2020-12-25         A3      U6            7
0   2021-01-01         A1      U1            8
1   2021-01-01         A1      U2            9
3   2021-01-02         A1      U1           10
2   2021-01-06         A1      U3           11
7   2021-01-10         A2      U4           12
8   2021-01-11         A2      U4           13
9   2021-01-12         A2      U4           14
17  2021-01-14         A3      U6           15
10  2021-01-15         A2      U5           16
20  2021-02-01         A2      U4           17
21  2021-02-01         A2      U5           18
18  2021-02-07         A1      U1           19
19  2021-02-10         A1      U2           20